{"config": {"layers": [{"config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 3, 224, 224], "sparse": false}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"kernel_size": [7, 7], "filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv1/7x7_s2", "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "strides": [2, 2], "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.00019999999494757503, "l1": 0.0}, "class_name": "L1L2"}, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1/7x7_s2", "class_name": "Conv2D"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["conv1/7x7_s2", 0, 0]]}, "keras_version": "2.1.3", "backend": "theano", "class_name": "Model"}