{"backend": "theano", "keras_version": "2.1.3", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_3", "inbound_nodes": [], "config": {"sparse": false, "name": "input_3", "dtype": "float32", "batch_input_shape": [null, null, null, 3]}}, {"class_name": "Conv2D", "name": "conv2d_189", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 32, "strides": [2, 2], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_189", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_189", "inbound_nodes": [[["conv2d_189", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_189", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_189", "inbound_nodes": [[["batch_normalization_189", 0, 0, {}]]], "config": {"name": "activation_189", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_190", "inbound_nodes": [[["activation_189", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 32, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_190", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_190", "inbound_nodes": [[["conv2d_190", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_190", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_190", "inbound_nodes": [[["batch_normalization_190", 0, 0, {}]]], "config": {"name": "activation_190", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_191", "inbound_nodes": [[["activation_190", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_191", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_191", "inbound_nodes": [[["conv2d_191", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_191", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_191", "inbound_nodes": [[["batch_normalization_191", 0, 0, {}]]], "config": {"name": "activation_191", "trainable": false, "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_9", "inbound_nodes": [[["activation_191", 0, 0, {}]]], "config": {"pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_9", "data_format": "channels_last", "trainable": false, "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_192", "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 80, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_192", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_192", "inbound_nodes": [[["conv2d_192", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_192", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_192", "inbound_nodes": [[["batch_normalization_192", 0, 0, {}]]], "config": {"name": "activation_192", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_193", "inbound_nodes": [[["activation_192", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 192, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_193", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_193", "inbound_nodes": [[["conv2d_193", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_193", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_193", "inbound_nodes": [[["batch_normalization_193", 0, 0, {}]]], "config": {"name": "activation_193", "trainable": false, "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_10", "inbound_nodes": [[["activation_193", 0, 0, {}]]], "config": {"pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_10", "data_format": "channels_last", "trainable": false, "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_197", "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_197", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_197", "inbound_nodes": [[["conv2d_197", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_197", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_197", "inbound_nodes": [[["batch_normalization_197", 0, 0, {}]]], "config": {"name": "activation_197", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_195", "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 48, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_195", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_198", "inbound_nodes": [[["activation_197", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 96, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_198", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_195", "inbound_nodes": [[["conv2d_195", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_195", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_198", "inbound_nodes": [[["conv2d_198", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_198", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_195", "inbound_nodes": [[["batch_normalization_195", 0, 0, {}]]], "config": {"name": "activation_195", "trainable": false, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_198", "inbound_nodes": [[["batch_normalization_198", 0, 0, {}]]], "config": {"name": "activation_198", "trainable": false, "activation": "relu"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_19", "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]], "config": {"pool_size": [3, 3], "padding": "same", "name": "average_pooling2d_19", "data_format": "channels_last", "trainable": false, "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_194", "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_194", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_196", "inbound_nodes": [[["activation_195", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_196", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_199", "inbound_nodes": [[["activation_198", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 96, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_199", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_200", "inbound_nodes": [[["average_pooling2d_19", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 32, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_200", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_194", "inbound_nodes": [[["conv2d_194", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_194", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_196", "inbound_nodes": [[["conv2d_196", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_196", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_199", "inbound_nodes": [[["conv2d_199", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_199", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_200", "inbound_nodes": [[["conv2d_200", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_200", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_194", "inbound_nodes": [[["batch_normalization_194", 0, 0, {}]]], "config": {"name": "activation_194", "trainable": false, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_196", "inbound_nodes": [[["batch_normalization_196", 0, 0, {}]]], "config": {"name": "activation_196", "trainable": false, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_199", "inbound_nodes": [[["batch_normalization_199", 0, 0, {}]]], "config": {"name": "activation_199", "trainable": false, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_200", "inbound_nodes": [[["batch_normalization_200", 0, 0, {}]]], "config": {"name": "activation_200", "trainable": false, "activation": "relu"}}, {"class_name": "Concatenate", "name": "mixed0", "inbound_nodes": [[["activation_194", 0, 0, {}], ["activation_196", 0, 0, {}], ["activation_199", 0, 0, {}], ["activation_200", 0, 0, {}]]], "config": {"axis": 3, "name": "mixed0", "trainable": false}}, {"class_name": "Conv2D", "name": "conv2d_204", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_204", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_204", "inbound_nodes": [[["conv2d_204", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_204", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_204", "inbound_nodes": [[["batch_normalization_204", 0, 0, {}]]], "config": {"name": "activation_204", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_202", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 48, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_202", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_205", "inbound_nodes": [[["activation_204", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 96, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_205", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_202", "inbound_nodes": [[["conv2d_202", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_202", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_205", "inbound_nodes": [[["conv2d_205", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_205", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_202", "inbound_nodes": [[["batch_normalization_202", 0, 0, {}]]], "config": {"name": "activation_202", "trainable": false, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_205", "inbound_nodes": [[["batch_normalization_205", 0, 0, {}]]], "config": {"name": "activation_205", "trainable": false, "activation": "relu"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_20", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"pool_size": [3, 3], "padding": "same", "name": "average_pooling2d_20", "data_format": "channels_last", "trainable": false, "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_201", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_201", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_203", "inbound_nodes": [[["activation_202", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_203", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_206", "inbound_nodes": [[["activation_205", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 96, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_206", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_207", "inbound_nodes": [[["average_pooling2d_20", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_207", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_201", "inbound_nodes": [[["conv2d_201", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_201", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_203", "inbound_nodes": [[["conv2d_203", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_203", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_206", "inbound_nodes": [[["conv2d_206", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_206", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_207", "inbound_nodes": [[["conv2d_207", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_207", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_201", "inbound_nodes": [[["batch_normalization_201", 0, 0, {}]]], "config": {"name": "activation_201", "trainable": false, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_203", "inbound_nodes": [[["batch_normalization_203", 0, 0, {}]]], "config": {"name": "activation_203", "trainable": false, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_206", "inbound_nodes": [[["batch_normalization_206", 0, 0, {}]]], "config": {"name": "activation_206", "trainable": false, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_207", "inbound_nodes": [[["batch_normalization_207", 0, 0, {}]]], "config": {"name": "activation_207", "trainable": false, "activation": "relu"}}, {"class_name": "Concatenate", "name": "mixed1", "inbound_nodes": [[["activation_201", 0, 0, {}], ["activation_203", 0, 0, {}], ["activation_206", 0, 0, {}], ["activation_207", 0, 0, {}]]], "config": {"axis": 3, "name": "mixed1", "trainable": false}}, {"class_name": "Conv2D", "name": "conv2d_211", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_211", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_211", "inbound_nodes": [[["conv2d_211", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_211", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_211", "inbound_nodes": [[["batch_normalization_211", 0, 0, {}]]], "config": {"name": "activation_211", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_209", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 48, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_209", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_212", "inbound_nodes": [[["activation_211", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 96, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_212", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_209", "inbound_nodes": [[["conv2d_209", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_209", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_212", "inbound_nodes": [[["conv2d_212", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_212", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_209", "inbound_nodes": [[["batch_normalization_209", 0, 0, {}]]], "config": {"name": "activation_209", "trainable": false, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_212", "inbound_nodes": [[["batch_normalization_212", 0, 0, {}]]], "config": {"name": "activation_212", "trainable": false, "activation": "relu"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"pool_size": [3, 3], "padding": "same", "name": "average_pooling2d_21", "data_format": "channels_last", "trainable": false, "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_208", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_208", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_210", "inbound_nodes": [[["activation_209", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_210", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "name": "conv2d_213", "inbound_nodes": [[["activation_212", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 96, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_213", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_214", "inbound_nodes": [[["average_pooling2d_21", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_214", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_208", "inbound_nodes": [[["conv2d_208", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_208", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_210", "inbound_nodes": [[["conv2d_210", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_210", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_213", "inbound_nodes": [[["conv2d_213", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_213", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_214", "inbound_nodes": [[["conv2d_214", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": false, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_214", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_208", "inbound_nodes": [[["batch_normalization_208", 0, 0, {}]]], "config": {"name": "activation_208", "trainable": false, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_210", "inbound_nodes": [[["batch_normalization_210", 0, 0, {}]]], "config": {"name": "activation_210", "trainable": false, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_213", "inbound_nodes": [[["batch_normalization_213", 0, 0, {}]]], "config": {"name": "activation_213", "trainable": false, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_214", "inbound_nodes": [[["batch_normalization_214", 0, 0, {}]]], "config": {"name": "activation_214", "trainable": false, "activation": "relu"}}, {"class_name": "Concatenate", "name": "mixed2", "inbound_nodes": [[["activation_208", 0, 0, {}], ["activation_210", 0, 0, {}], ["activation_213", 0, 0, {}], ["activation_214", 0, 0, {}]]], "config": {"axis": 3, "name": "mixed2", "trainable": false}}, {"class_name": "Conv2D", "name": "conv2d_216", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_216", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_216", "inbound_nodes": [[["conv2d_216", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_216", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_216", "inbound_nodes": [[["batch_normalization_216", 0, 0, {}]]], "config": {"name": "activation_216", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_217", "inbound_nodes": [[["activation_216", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "filters": 96, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_217", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_217", "inbound_nodes": [[["conv2d_217", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_217", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_217", "inbound_nodes": [[["batch_normalization_217", 0, 0, {}]]], "config": {"name": "activation_217", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_215", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "filters": 384, "strides": [2, 2], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_215", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_218", "inbound_nodes": [[["activation_217", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "filters": 96, "strides": [2, 2], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_218", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_215", "inbound_nodes": [[["conv2d_215", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_215", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_218", "inbound_nodes": [[["conv2d_218", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_218", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_215", "inbound_nodes": [[["batch_normalization_215", 0, 0, {}]]], "config": {"name": "activation_215", "trainable": true, "activation": "relu"}}, {"class_name": "Activation", "name": "activation_218", "inbound_nodes": [[["batch_normalization_218", 0, 0, {}]]], "config": {"name": "activation_218", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_11", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_11", "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Concatenate", "name": "mixed3", "inbound_nodes": [[["activation_215", 0, 0, {}], ["activation_218", 0, 0, {}], ["max_pooling2d_11", 0, 0, {}]]], "config": {"axis": 3, "name": "mixed3", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_223", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "filters": 128, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_223", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_223", "inbound_nodes": [[["conv2d_223", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_223", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_223", "inbound_nodes": [[["batch_normalization_223", 0, 0, {}]]], "config": {"name": "activation_223", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_224", "inbound_nodes": [[["activation_223", 0, 0, {}]]], "config": {"use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "filters": 128, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_224", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [7, 1]}}, {"class_name": "BatchNormalization", "name": "batch_normalization_224", "inbound_nodes": [[["conv2d_224", 0, 0, {}]]], "config": {"gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "scale": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "name": "batch_normalization_224", 