{"class_name": "Model", "keras_version": "2.1.3", "backend": "theano", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "sparse": false, "name": "input_1"}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 32, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_1", "data_format": "channels_last", "strides": [2, 2], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_1", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_1"}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 32, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_2", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_2", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_2"}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_3", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_3", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"trainable": false, "strides": [2, 2], "pool_size": [3, 3], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 80, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_4", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_4", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_4"}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 192, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_5", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_5", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_5"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"trainable": false, "strides": [2, 2], "pool_size": [3, 3], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_9", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_9", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_9"}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 48, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_7", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 96, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_10", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_7", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_10", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_7"}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_10"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"trainable": false, "strides": [1, 1], "pool_size": [3, 3], "padding": "same", "data_format": "channels_last", "name": "average_pooling2d_1"}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_6", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_8", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 96, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_11", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 32, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_12", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_6", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_8", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_11", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_12", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_6"}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_8"}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_11"}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_12"}}, {"class_name": "Concatenate", "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "config": {"name": "mixed0", "trainable": false, "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_16", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_16", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_16"}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 48, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_14", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 96, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_17", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_14", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_17", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_14"}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_17"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"trainable": false, "strides": [1, 1], "pool_size": [3, 3], "padding": "same", "data_format": "channels_last", "name": "average_pooling2d_2"}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_13", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_15", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 96, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_18", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_19", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_13", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_15", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_18", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_19", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_13"}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_15"}}, {"class_name": "Activation", "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_18"}}, {"class_name": "Activation", "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_19"}}, {"class_name": "Concatenate", "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"name": "mixed1", "trainable": false, "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_23", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_23", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_23"}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 48, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_21", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 96, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_24", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_21", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_24", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_21"}}, {"class_name": "Activation", "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_24"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"trainable": false, "strides": [1, 1], "pool_size": [3, 3], "padding": "same", "data_format": "channels_last", "name": "average_pooling2d_3"}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_20", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_22", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 96, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_25", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_26", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": false, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_20", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_22", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_25", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": false, "name": "batch_normalization_26", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_20"}}, {"class_name": "Activation", "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_22"}}, {"class_name": "Activation", "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_25"}}, {"class_name": "Activation", "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_26"}}, {"class_name": "Concatenate", "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "config": {"name": "mixed2", "trainable": false, "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_28", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "name": "batch_normalization_28", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_28"}}, {"class_name": "Conv2D", "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 96, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_29", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "name": "batch_normalization_29", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_29"}}, {"class_name": "Conv2D", "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 384, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_27", "data_format": "channels_last", "strides": [2, 2], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 96, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_30", "data_format": "channels_last", "strides": [2, 2], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "name": "batch_normalization_27", "center": true, "axis": 3}}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "name": "batch_normalization_30", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_27"}}, {"class_name": "Activation", "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_30"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "pool_size": [3, 3], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_3"}}, {"class_name": "Concatenate", "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"name": "mixed3", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 128, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_35", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "name": "batch_normalization_35", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_35"}}, {"class_name": "Conv2D", "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "filters": 128, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_36", "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "kernel_size": [7, 1], "activity_regularizer": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": false, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "name": "batch_normalization_36", "center": true, "axis": 3}}, {"class_name": "Activation", "name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": 