{"keras_version": "2.1.3", "class_name": "Model", "backend": "theano", "config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, null, null, 3], "sparse": false, "dtype": "float32"}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_1", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 32, "padding": "valid", "strides": [2, 2], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_1", "activation": "relu"}}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_2", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 32, "padding": "valid", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_2", "activation": "relu"}}, {"name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_3", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_3", "activation": "relu"}}, {"name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "trainable": false, "name": "max_pooling2d_1"}}, {"name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_4", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 80, "padding": "valid", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_4", "activation": "relu"}}, {"name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_5", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 192, "padding": "valid", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_5", "activation": "relu"}}, {"name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "trainable": false, "name": "max_pooling2d_2"}}, {"name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_9", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_9", "activation": "relu"}}, {"name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_7", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 48, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_10", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 96, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_10", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_7", "activation": "relu"}}, {"name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_10", "activation": "relu"}}, {"name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"padding": "same", "strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "trainable": false, "name": "average_pooling2d_1"}}, {"name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_6", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_8", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "activity_regularizer": null}}, {"name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_11", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 96, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_12", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 32, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_11", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_12", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_6", "activation": "relu"}}, {"name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_8", "activation": "relu"}}, {"name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_11", "activation": "relu"}}, {"name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_12", "activation": "relu"}}, {"name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": false, "axis": 3, "name": "mixed0"}}, {"name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_16", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_16", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_16", "activation": "relu"}}, {"name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_14", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 48, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_17", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 96, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_14", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_17", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_14", "activation": "relu"}}, {"name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_17", "activation": "relu"}}, {"name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"padding": "same", "strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "trainable": false, "name": "average_pooling2d_2"}}, {"name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_13", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_15", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "activity_regularizer": null}}, {"name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_18", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 96, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_19", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_13", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_15", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_18", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_19", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_13", "activation": "relu"}}, {"name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_15", "activation": "relu"}}, {"name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_18", "activation": "relu"}}, {"name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_19", "activation": "relu"}}, {"name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": false, "axis": 3, "name": "mixed1"}}, {"name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_23", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_23", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_23", "activation": "relu"}}, {"name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_21", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 48, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_24", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 96, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_21", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_24", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_21", "activation": "relu"}}, {"name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_24", "activation": "relu"}}, {"name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"padding": "same", "strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "trainable": false, "name": "average_pooling2d_3"}}, {"name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_20", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_22", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "activity_regularizer": null}}, {"name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_25", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 96, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_26", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_20", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_22", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_25", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_26", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_20", "activation": "relu"}}, {"name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_22", "activation": "relu"}}, {"name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_25", "activation": "relu"}}, {"name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_26", "activation": "relu"}}, {"name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": false, "axis": 3, "name": "mixed2"}}, {"name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_28", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 64, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_28", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_28", "activation": "relu"}}, {"name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_29", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 96, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_29", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_29", "activation": "relu"}}, {"name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_27", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 384, "padding": "valid", "strides": [2, 2], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_30", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 96, "padding": "valid", "strides": [2, 2], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}, {"name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_27", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_30", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_27", "activation": "relu"}}, {"name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_30", "activation": "relu"}}, {"name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "trainable": false, "name": "max_pooling2d_3"}}, {"name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": false, "axis": 3, "name": "mixed3"}}, {"name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_35", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 128, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null}}, {"name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_35", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "name": "activation_35", "activation": "relu"}}, {"name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_36", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "filters": 128, "padding": "same", "strides": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [7, 1], "activity_regularizer": null}}, {"name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"axis": 3, "name": "batch_normalization_36", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": false, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false}}, {"name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": 